{
  "intro": "Pillai HOC College of Arts, Science & Commerce (PHCASC) established in 2008 under Mahatma Education Society. NAAC Grade A+ accredited, affiliated to Mumbai University. Located in a sprawling 35-acre green campus at Rasayani, it offers UG & PG programs with modern facilities and a vibrant campus life.",
  
  "courses": [
    "B.Sc Computer Science",
    "B.Sc Information Technology",
    "B.Sc Data Science",
    "BMS (Bachelor of Management Studies)",
    "B.A. (Bachelor of Arts)",
    "B.Com Accounting & Finance",
    "M.Sc IT",
    "M.Com",
    "Diploma in Hospitality Management",
    "B.Ed. (through PHCER)"
  ],
  
  "placements": "PHCASC has a strong placement record with 50+ companies visiting annually. The highest package recorded is ₹4 LPA and the average package is ₹2.5 LPA. Placement assistance includes resume building, interview prep, and industrial training tie-ups.",
  
  "campus": "The campus includes advanced computer labs with latest software, a digital library, spacious auditoriums, seminar halls, sports grounds, training kitchens for hospitality, and well-equipped classrooms. Hostel and transport facilities are available nearby.",
  
  "faculty": "Experienced faculty with PhDs and strong industry experience across departments like Computer Science, Commerce, Hospitality, and Education. Faculty actively engage in research and student mentoring.",
  
  "clubs": "Clubs include Computer Society, Commerce Club, Arts & Cultural Association, NSS Unit, Sports Teams (Cricket, Football, Badminton), and Entrepreneurship Cell.",
  
  "admission": "Admissions are based on merit and follow Mumbai University guidelines. Applications can be submitted online via the college website or offline. Fee structure ranges approx from ₹12,700 to ₹22,100 annually depending on course.",
  
  "events": "Regular events include the annual cultural fest 'Raag', tech symposiums, guest lectures by industry experts, workshops, and NSS social initiatives.",
  
  "contact": "For admissions and general inquiries, contact +91 89285 58081 or email pillaihoc@mes.ac.in. Visit https://phcasc.ac.in for latest updates."
}
